<template>
  <div>
    <p>3.1 Оплата производится за предстоящий период.</p>
    <p>
      3.2 После оплаты выбранного периода &laquo;Pro подписки&raquo;,
      пользователь получает доступ к дополнительным, расширенным функциям
      приложения. Профессиональные функции останутся доступными до конца
      оплаченного периода, даже после отключения подписки.
    </p>
    <p>
      3.3 Денежные средства, внесенные за определенный период, возврату не
      подлежат. Даже в случае прекращения использования приложения, в том числе,
      удаления аккаунта по запросу пользователя.
    </p>
  </div>
</template>