<template>
  <div>
    <p>
      2.1 Вся ответственность за хранимые в приложении данные, связанные с
      аккаунтом пользователя, лежит на пользователе, разместившем эти данные.
    </p>
    <p>
      2.2 Администрация сервиса не несет ответственности за размещаемые
      пользователями данные.
    </p>
    <p>
      2.3 Данные паролей и контактов шифруются на стороне клиента и хранятся в
      базе данных в зашифрованном виде. Администрация сервиса не имеет
      возможности чтения этих данных, и не сможет помочь с их восстановлением в
      случае утери доступа к аккаунту.
    </p>
  </div>
</template>