<template>
  <div>
    <p>
      1.1 Данное пользовательское соглашение действительно на момент работы
      приложения (сервиса).
    </p>
    <p>
      1.2 Нажав на кнопку &laquo;Зарегистрироваться&raquo;, пользователь
      подтверждает свое согласие с данным соглашением.
    </p>
    <p>
      1.3 Данное пользовательское соглашение может быть обновлено без
      уведомления пользователя. Пользователь обязуется самостоятельно,
      периодически проверять наличие изменений.
    </p>
    <p>
      1.4 В случае несогласия с каким-либо пунктом данного соглашения,
      пользователь вправе прекратить использование сервиса и удалить свой
      аккаунт вместе со всеми связанными с ним данными.
    </p>
    <p>
      1.5 Удаление аккаунта пользователя осуществляется по запросу, путем
      отправки электронного письма с адреса принадлежащему аккаунту на адрес
      службы технической поддержки
      <a href="mailto:mccrush2027@gmail.com">mccrush2027@gmail.com</a>
    </p>
  </div>
</template>