<template>
  <div>
    <h6>3.1 Оформление подписки</h6>
    <p>
      Вы можете выбрать желаемы период оформления подписки, от 1 месяца до года.
      При оформлении подписки сразу на год, вы получаете скидку равную стоимости
      2-х месяцев подписки (сколько, сколько рублей?).
    </p>

    <h6>3.2 Продление подписки</h6>
    <p>
      Для продления подписки, необходимо перейти на страницу настройки аккаунта
      и в соответствующем разделе нажать на кнопку «Продлить подписку».
    </p>

    <h6>3.3 Отключение подписки</h6>
    <p>
      Отключить подписку можно в любой момент на странице настройки аккаунта в
      соответствующем разделе, нажав на кнопку «Отключить подписку». При этом
      «Pro функции» останутся доступны до конца оплаченного периода подписки.
    </p>
  </div>
</template>