<template>
  <div>
    <h6>4.1 Создание нового проекта</h6>
    <p>
      Для создания проекта, в левой части страницы «Проекты» введите в текстовое
      поле название и затем нажмите на кнопку «Добавить проект» (или нажмите
      клавишу Enter). Имейте ввиду, что максимальная длина имени проекта
      составляет 32 символа.
    </p>

    <h6>4.2 Редактирование проекта</h6>
    <p>
      Для изменения имени проекта или его позиции в списке, кликните по проекту,
      чтобы слева от названия появилась кнопка «Редактировать» (иконка
      карандаша). После нажатия на кнопку «Редактировать», под списком проектов
      отобразится форма с информацией о проекте. Вы можете сохранить внесенные
      изменения нажатием на кнопку «Сохранить» (иконка дискеты), либо удалить
      проект (иконка корзины).
    </p>
    <p>
      Обращаем ваше внимание на то, что при удалении проекта будет удалена и вся
      связанная с ним информация (ссылки, пароли, контакты, задачи) без
      возможности восстановления.
    </p>

    <h6>4.3 Работа с формами</h6>
    <p>
      Справа от списка проектов расположены вкладки с определенными видами
      информации. Для переключения между ними, нажимайте на кнопки с
      соответствующим названием (ссылки, пароли, контакты, задачи). (скриншот)
    </p>
    <p>
      Вы можете создать до 4 форм в каждой из вкладок (и 8 задач) с бесплатной
      подпиской, и 64 с Профессиональным планом. Для этого нажмите на кнопку
      &laquo;Добавить форму&raquo; (иконка плюса). Отобразиться пустая форма.
      (скриншот)
    </p>
    <p>
      Обращаем ваше внимание, что длина вводимых данных ограничена следующими
      значениями:
    </p>

    <table
      class="table table-sm table-striped table-bordered align-middle lh-sm"
    >
      <tbody>
        <tr class="text-center">
          <td width="50%">
            <strong>Название поля</strong>
          </td>
          <td>
            <strong>Максимальное<br />количество символов</strong>
          </td>
        </tr>
        <tr>
          <td width="50%">Название ссылки</td>
          <td class="text-center">32</td>
        </tr>
        <tr>
          <td width="50%">Ссылка</td>
          <td class="text-center">256</td>
        </tr>
        <tr>
          <td width="50%">&nbsp;</td>
          <td class="text-center">&nbsp;</td>
        </tr>
        <tr>
          <td width="50%">Название пароля</td>
          <td class="text-center">32</td>
        </tr>
        <tr>
          <td width="50%">Ссылка на авторизацию</td>
          <td class="text-center">256</td>
        </tr>
        <tr>
          <td width="50%">Логин</td>
          <td class="text-center">64</td>
        </tr>
        <tr>
          <td width="50%">Пароль</td>
          <td class="text-center">32</td>
        </tr>
        <tr>
          <td width="50%">&nbsp;</td>
          <td class="text-center">&nbsp;</td>
        </tr>
        <tr>
          <td width="50%">Имя контакта</td>
          <td class="text-center">32</td>
        </tr>
        <tr>
          <td width="50%">Поле контакта</td>
          <td class="text-center">64</td>
        </tr>
        <tr>
          <td width="50%">
            <strong>&nbsp;</strong>
          </td>
          <td>&nbsp;</td>
        </tr>
        <tr>
          <td width="50%">Задача и подзадача</td>
          <td class="text-center">128</td>
        </tr>
      </tbody>
    </table>

    <p>
      Информация в формах сохраняется автоматически при потере фокуса вводимого
      поля.
    </p>
    <p>
      Для удаления формы, нажмите на кнопку &laquo;Удалить форму&raquo; (иконка
      корзины). (скриншот)
    </p>
  </div>
</template>