<template>
  <div>
    <p>
      Приложение MWP предназначено для хранения информации, связанной с
      разработкой программного обеспечения. Подразумевается, что связанная между
      собой информация, объединяется в проекты. На данный момент в каждом из
      проектов доступно хранение четырех видов информации: ссылки, пароли,
      контакты, задачи.
    </p>
    <p>
      Вводимые данные логинов, паролей и полей контактов, шифруются на стороне
      клиента с помощью
      <a
        href="https://en.wikipedia.org/wiki/Advanced_Encryption_Standard"
        target="_blank"
        >стандарта AES-256</a
      >
      и хранятся в базе данных в зашифрованном виде. Таким образом у
      разработчиков нет возможности получения персональной информации, а также
      возможности восстановления этой информации в случае утери доступа к своему
      аккаунту пользователя приложения MWP.
    </p>
    <p>
      В приложении существуют ограничения как на количество создаваемых
      проектов, так и на количество создаваемых форм для каждого вида
      информации. В том числе ограничено количество полей контактов в каждой из
      форм, максимум 8.
    </p>
    <p>
      Также есть ограничение на максимальную длину вводимых строк в формы
      (название проекта, URL ссылка, пароль, имя контакта и т.д.).
    </p>

    <table
      class="table table-sm table-striped table-bordered align-middle lh-sm"
    >
      <tbody>
        <tr class="text-center">
          <td width="50%">
            <strong>Название поля</strong>
          </td>
          <td>
            <strong>Максимальное<br />количество символов</strong>
          </td>
        </tr>
        <tr>
          <td>Логин пользователя MWP</td>
          <td class="text-center">64</td>
        </tr>
        <tr>
          <td>Пароль пользователя MWP</td>
          <td class="text-center">32</td>
        </tr>
      </tbody>
    </table>

    <p>
      В приложении предусмотрена возможность расширения базового (бесплатного)
      функционала, в том числе увеличении максимального количества создаваемых
      проектов и видов информации в них.
    </p>
    <p>
      В приведенной ниже таблице, указаны основные различия между базовой и
      профессиональной подпиской:
    </p>

    <table
      class="table table-sm table-striped table-bordered align-middle lh-sm"
    >
      <tbody>
        <tr class="text-center">
          <td width="208"></td>
          <td width="208">
            <strong>Базовая подписка</strong>
          </td>
          <td width="208">
            <strong>Профессиональная подписка</strong>
          </td>
        </tr>
        <tr>
          <td width="208">Максимальное количество проектов</td>
          <td class="text-center" width="208">4</td>
          <td class="text-center" width="208">64</td>
        </tr>
        <tr>
          <td width="208">
            Максимальное количество форм во вкладках Ссылки, Пароли, Контакты
          </td>
          <td class="text-center" width="208">4</td>
          <td class="text-center" width="208">64</td>
        </tr>
        <tr>
          <td width="208">Максимальное количество Задач и Подзадач</td>
          <td class="text-center" width="208">8</td>
          <td class="text-center" width="208">64</td>
        </tr>
        <tr>
          <td width="208">Максимальный уровень вложенности подзадач</td>
          <td class="text-center" width="208">4</td>
          <td class="text-center" width="208">4</td>
        </tr>
      </tbody>
    </table>

    <p>
      На текущий момент доступна версия приложения, рассчитанная на отображение
      только на мониторах компьютеров. Но прямо сейчас мы работаем и над версией
      для экранов телефонов.
    </p>
    <p>
      Для связи с командой разработчиков, вы можете использовать данный адрес
      электронной почты
      <a href="mailto:mccrush2027@gmail.com">mccrush2027@gmail.com</a>
    </p>
    <p>
      Мы будем рады ответить на интересующие вас вопросы и предложения по
      усовершенствованию приложения MWP.
    </p>
  </div>
</template>