<template>
  <div class="p-3">
    <h4>Руководство пользователя</h4>
    <p>
      Приложение MWP предназначено для хранения информации, связанной с
      разработкой программного обеспечения. Подразумевается, что связанная между
      собой информация, объединяется в проекты. На данный момент в каждом из
      проектов доступно хранение трех видов информации: ссылки, пароли,
      контакты.
    </p>
    <p>
      В приложении существуют ограничения как на количество создаваемых
      проектов, так и на количество создаваемых форм для каждого вида
      информации. А также есть ограничение на максимальную длину вводимых строк
      в формы (название проекта, URL ссылка, пароль, имя контакта и т.д.).
    </p>
    <p>
      Для связи с командой разработчиков, вы можете использовать данный адрес
      электронной почты mccrush2027@gmail.com
    </p>
    <p></p>
  </div>
</template>